InformationRegisters/фин_ПрименениеПравилАвтоматическогоРасчетаРазрезов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_ПрименениеПравилАвтоматическогоРасчетаРазрезов</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименятьПравило</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ПравилаАвтоматическогоРасчетаРазрезовБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/фин_ПрименениеПравилАвтоматическогоРасчетаРазрезов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.ПрименятьПравило И Запись.Правило.Пустая() Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Не выбрано правило!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Разрез = фин_РаботаСДополнительнымиРазрезамиБюджетирования.РазрезПоИзмерению(Запись.Измерение);
	Для Каждого ЭлементСписка Из фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПолучитьПолныйСписокРазрезов() Цикл
		СписокРазрезов.Добавить(фин_РаботаСДополнительнымиРазрезамиБюджетирования.РазрезПоИзмерению(ЭлементСписка.Значение));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПланированияПроизводстваПродукцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокРазрезов;
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПланированияПроизводстваПродукцииПриИзменении(Элемент)
	ПоказательПланированияПроизводстваПродукцииПриИзмененииНаСервере();
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПланированияПроизводстваПродукцииПриИзмененииНаСервере()
	Запись.Измерение = фин_РаботаСДополнительнымиРазрезамиБюджетирования.ИзмерениеПоРазрезу(Разрез);
КонецПроцедуры
